app/controllers/api/images_controller.rb

    def create
        tags = Image.generate_tags(create_image_params[:img_file])
        @image = Image.create_image(create_image_params, current_user)
        @image.update(tags: tags)
---
INSERT INTO "images" ("title", "tags", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "images" SET "updated_at" = $1 WHERE "images"."id" = $2  [["updated_at", "2021-05-02 23:49:55.969687"], ["id", "44c512e2-5dde-4950-950a-d096a483a094"]]

    def set_image
        @image = Image.find(params[:id])
---
SELECT "images".* FROM "images" WHERE (user_id = '3634e527-7499-46bf-9a2c-ad6205e2a587' AND public_view = true) ORDER BY "images"."created_at" DESC