backend/app/models/image.rb

  def self.create_image(image_params, current_user)
    image = Image.new({
      user_id: current_user[:id],
      title: image_params[:title],
      description: image_params[:description],
      public_view: image_params[:public_view],
    })
    image.img_file.attach(image_params[:img_file])
    image.save!
---
INSERT INTO "images" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "images" ("title", "tags", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"